---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkUnderConstrained
source: html/81fcae21-46db-346c-22c1-6dcbf4e7e8f7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkUnderConstrained Property

The network is under constrained. You may specify the design flow value in the missing branches, or cap the open ends.

## Syntax (C#)
```csharp
public static FailureDefinitionId NetworkUnderConstrained { get; }
```